/**
|--------------------------------------------------
| 假设你正在爬楼梯。需要 n 阶你才能到达楼顶。

每次你可以爬 1 或 2 个台阶。
你有多少种不同的方法可以爬到楼顶呢？
输入：n = 2
输出：2
解释：有两种方法可以爬到楼顶。
1. 1 阶 + 1 阶
2. 2 阶

输入：n = 3
输出：3
解释：有三种方法可以爬到楼顶。
1. 1 阶 + 1 阶 + 1 阶
2. 1 阶 + 2 阶
3. 2 阶 + 1 阶

|--------------------------------------------------
*/
var climbStairs = function (n) {
  if (n <= 1) return n
  let dp = [3]
  dp[1] = 1
  dp[2] = 2
  for (let i = 3; i <= n; i++) {
    let sum = dp[1] + dp[2]
    dp[1] = dp[2]
    dp[2] = sum
  }
  return dp[2]
}

var climbStairs = function (n) {
  // dp[i] 为第 i 阶楼梯有多少种方法爬到楼顶
  // dp[i] = dp[i - 1] + dp[i - 2]
  let dp = [1, 2]
  for (let i = 2; i < n; i++) {
    dp[i] = dp[i - 1] + dp[i - 2]
  }
  return dp[n - 1]
}
